
PURPOSE_CHOICES = (
    ('出費を抑えたい', '出費を抑えたい'),
    ('交流を楽しみたい', '交流を楽しみたい'),
    ('同居人が欲しい', '同居人が欲しい'),
    ('人脈を広げたい', '人脈を広げたい'),
    ('家賃を抑えていい家に住みたい', '家賃を抑えていい家に住みたい'),
    ('目標に向かって頑張れる仲間が欲しい', '目標に向かって頑張れる仲間が欲しい'),
    ('外国人との交流を通じて語学力を向上させたい', '外国人との交流を通じて語学力を向上させたい'),
    ('共同で趣味に没頭できる人を探している', '共同で趣味に没頭できる人を探している'),
    ('その他', 'その他'),
)

DESIRED_COHABITEE_CHOICES = (
    ('2', '2人'),
    ('3', '3人'), 
    ('4', '4人'), 
    ('5', '5人'),
)

LAYOUT_CHOICES = (
    ('1R', '1R'),
    ('1K', '1K'),
    ('1DK', '1DK'),
    ('1LDK', '1LDK'),
    ('2K', '2K'),
    ('2DK', '2DK'),
    ('2LDK', '2LDK'),
    ('3K', '3K'),
    ('3DK', '3DK'),
    ('3LDK', '3LDK'),
)

RENT_CHOICES = (
    ("3万円以下", "3万円以下"), 
    ("3万円～4.5万円", "3万円～4.5万円"),
    ("4.5万円～6万円", "4.5万円～6万円"), 
    ("6万円～7.5万円", "6万円～7.5万円"),
    ("7.5万円～9万円", "7.5万円～9万円"), 
    ("9万円～11.5万円", "9万円～11.5万円"),
    ("12万円以上", "12万円以上")
)

GENDER_CHOICES = (
    ('男性', '男性'),
    ('女性', '女性'),
)

OCCUPATION_CHOICES = (
    ('学生', '学生'), 
    ('社会人', '社会人'), 
    ('その他', 'その他'), 
)

PREFECTURE_CHOICES = (
    ('北海道', '北海道'),
    ('青森県', '青森県'),
    ('岩手県', '岩手県'),
    ('宮城県', '宮城県'),
    ('秋田県', '秋田県'),
    ('山形県', '山形県'),
    ('福島県', '福島県'),
    ('茨城県', '茨城県'),
    ('栃木県', '栃木県'),
    ('群馬県', '群馬県'),
    ('埼玉県', '埼玉県'),
    ('千葉県', '千葉県'),
    ('東京都', '東京都'),
    ('神奈川県', '神奈川県'),
    ('新潟県', '新潟県'),
    ('富山県', '富山県'),
    ('石川県', '石川県'),
    ('福井県', '福井県'),
    ('山梨県', '山梨県'),
    ('長野県', '長野県'),
    ('岐阜県', '岐阜県'),
    ('静岡県', '静岡県'),
    ('愛知県', '愛知県'),
    ('三重県', '三重県'),
    ('滋賀県', '滋賀県'),
    ('京都府', '京都府'),
    ('大阪府', '大阪府'),
    ('兵庫県', '兵庫県'),
    ('奈良県', '奈良県'),
    ('和歌山県', '和歌山県'),
    ('鳥取県', '鳥取県'),
    ('島根県', '島根県'),
    ('岡山県', '岡山県'),
    ('広島県', '広島県'),
    ('山口県', '山口県'),
    ('徳島県', '徳島県'),
    ('香川県', '香川県'),
    ('愛媛県', '愛媛県'),
    ('高知県', '高知県'),
    ('福岡県', '福岡県'),
    ('佐賀県', '佐賀県'),
    ('長崎県', '長崎県'),
    ('熊本県', '熊本県'),
    ('大分県', '大分県'),
    ('宮崎県', '宮崎県'),
    ('鹿児島県', '鹿児島県'),
    ('沖縄県', '沖縄県'),
)


SMOKING_CHOICES = (
    ('喫煙', '喫煙'), 
    ('禁煙', '禁煙'), 
)

PET_CHOICES = (
    ('YES', 'YES'),
    ('NO', 'NO'),
)

PARKING_CHOICES = (
    ('必要', '必要'),
    ('不要', '不要'),
)

COMMUTE_TIME_CHOICES = (
    ('徒歩5分圏内', '徒歩5分圏内'),
    ('徒歩10分圏内', '徒歩10分圏内'),
    ('徒歩15分圏内', '徒歩15分圏内'),
    ('徒歩15分圏上', '徒歩15分圏上'),
)

PERIOD_CHOICES = (
    ('1ヶ月以内','1ヶ月以内'),
    ('1-3ヶ月以内','1-3ヶ月以内'),
    ('3-6ヶ月以内','3-6ヶ月以内'),
    ('1年以内','1年以内'),
    ('1年以上','1年以上'),
)
